docs/1c-export-2026-06-02/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеТЧ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/Чат1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Чат1С</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Повідомлення</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрочитано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВбудованеЗначення</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваДодатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникИдентыфикатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаСервере</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Організація</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Відправник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Одержувач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЧата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уид_Сообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/НепрочитаніПовідомлення.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НепрочитаніПовідомлення</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Одержувач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Відправник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЧата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/НаявністьДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>НаявністьДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ТипыДействийПриНапоминании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыДействийПриНапоминании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСтарыхЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжениеБрониТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщенияВайберОВидео</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/Общий/Ext/Module.bsl
Функция ПрошелКонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЗначениеСсылка) 
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Спр.Ссылка
    |ИЗ
    |    Справочник." + ИмяОбъекта + " КАК Спр
    |ГДЕ
    |    Спр.Ссылка <> &парЗначениеСсылка И НЕ Спр.Ссылка.ПометкаУдаления
    |";     
    Нум = 0;
	Для Каждого Знч Из СтрРеквизитов Цикл
		
        ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
        Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе; 
        Запрос.УстановитьПараметр("Пар" + Строка(Нум),    Знч.Значение);
        Нум = Нум + 1;
    КонецЦикла;    
    Запрос.УстановитьПараметр("парЗначениеСсылка",         ЗначениеСсылка);        
    РезультатЗапроса = Запрос.Выполнить();
        Возврат РезультатЗапроса.Пустой(); 
КонецФункции

Функция КонтрольУникальностиПоРеквизиту(ЭтотОбъект, ИмяРеквизита) Экспорт
    ИмяОбъекта = ЭтотОбъект.Метаданные().Имя;
    СтрРеквизитов = Новый Структура; //
    СтрРеквизитов.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
	Если Не ПрошелКонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЭтотОбъект.Ссылка) Тогда
		#Если Клиент Тогда 
        Сообщить("Подобный элемент справочника /" + ЭтотОбъект[ИмяРеквизита] + "/ существует!
                |Модуль: Контроль уникальности элементов справочника." );
		#КонецЕсли
		Возврат Ложь;
	КонецЕсли;	
	Возврат Истина;
КонецФункции

Функция ТелефонКонтрагентаСтрокой(Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.НомерТелефона,
	               |	Контрагенты.ДополнительныеНомераТелефонов.(
	               |		Номер
	               |	)
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Рез = Запрос.Выполнить().Выгрузить();
	НомераСтрокой = "";
	Если Рез.Количество() > 0 Тогда
		Если Рез[0].ДополнительныеНомераТелефонов.Количество() > 0 Тогда
			Для Каждого Строка из Рез[0].ДополнительныеНомераТелефонов Цикл
				Если ЗначениеЗаполнено(НомераСтрокой) Тогда
					НомераСтрокой = НомераСтрокой + " ";
				КонецЕсли;
				
				НомераСтрокой = НомераСтрокой + СтрЗаменить(Строка.Номер, " ", ""); 	
			КонецЦикла;
		КонецЕсли;
		
		
		Если СтрДлина(Рез[0].НомерТелефона) > 7 Тогда
			Возврат Рез[0].НомерТелефона + " " + НомераСтрокой;
		Иначе
			Возврат НомераСтрокой;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция НеОтгруженныеТоварыСЗаказов(Товар, Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура.Ссылка = &Ссылка) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура";
		
	Запрос.УстановитьПараметр("Ссылка", Товар);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция СоздатьЗаказ(ТекущийКонтрагент, ДатаДокумента) Экспорт 
	
	Если ТекущийКонтрагент 	= Справочники.Контрагенты.ПустаяСсылка() Тогда 
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;		
	
	ЗапросЗаказа = Новый Запрос;
	ЗапросЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Контрагент = &Контрагент
	|	И ЗаказПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И НЕ ЗаказПокупателя.ПометкаУдаления";
	ЗапросЗаказа.УстановитьПараметр("Контрагент", ТекущийКонтрагент);		
	ЗапросЗаказа.УстановитьПараметр("ДоговорКонтрагента", ТекущийКонтрагент.ДоговорДляНеплановыхПродаж);
	
	РезультатЗапроса = ЗапросЗаказа.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка 		   = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументЗаказ = Выборка.Ссылка.ПолучитьОбъект();
	Иначе 	
		ДокументЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();	
		ДокументЗаказ.Дата 								= ДатаДокумента - 1;
		мВалютаУправленческогоУчета 					= Константы.ВалютаУправленческогоУчета.Получить();
		мВалютаРегламентированногоУчета 				= Константы.ВалютаРегламентированногоУчета.Получить();
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументЗаказ, глЗначениеПеременной("глТекущийПользователь"), мВалютаУправленческогоУчета, "Продажа");
		ДокументЗаказ.Контрагент 					= ТекущийКонтрагент;
		ДокументЗаказ.ДоговорКонтрагента 			= ТекущийКонтрагент.ДоговорДляНеплановыхПродаж;
		ДокументЗаказ.Комментарий 					= "Створено для заповнення маршрутних листів.";
	КонецЕсли;	
	
	ДокументЗаказ.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ДокументЗаказ.Ссылка;
	
КонецФункции

Процедура ЗаписатьВерсию(ДокументСсылка, ДокументОбъект) Экспорт
	
	НомерВерсии = 0;
	ЗапросНомераВерсии = Новый Запрос;
	ЗапросНомераВерсии.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Документ,
	    |	МАКСИМУМ(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
	    |ИЗ
       	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
       	|ГДЕ
       	|	ВерсииОбъектов.Документ = &Документ
       	|
       	|СГРУППИРОВАТЬ ПО
       	|	ВерсииОбъектов.Документ";
	ЗапросНомераВерсии.УстановитьПараметр("Документ", ДокументСсылка);
	РезультатЗапроса = ЗапросНомераВерсии.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НомерВерсии = Выборка.НомерВерсии + 1;	
	Иначе 
		НомерВерсии = 1;	
	КонецЕсли;	
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументСсылка);
	НаборЗаписей.Отбор.НомерВерсии.Установить(НомерВерсии);
	НаборЗаписей.Прочитать();
	
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл 	
		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.Документ 			= ДокументСсылка;
		НоваяЗапись.НомерВерсии 		= НомерВерсии;
		НоваяЗапись.ПериодВерсии   		= ТекущаяДата();
		НоваяЗапись.ИмяРеквизита 		= Реквизит.Имя;
		НоваяЗапись.ЗначениеРеквизита 	= ДокументОбъект[Реквизит.Имя];
	КонецЦикла;	

	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл 
		ТекущаяТЗ = ДокументОбъект[ТабличнаяЧасть.Имя].Выгрузить();
		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.Документ 			= ДокументСсылка;
		НоваяЗапись.НомерВерсии 		= НомерВерсии;
		НоваяЗапись.ПериодВерсии   		= ТекущаяДата();
		НоваяЗапись.ИмяРеквизита 		= ТабличнаяЧасть.Имя;
		НоваяЗапись.ЗначениеРеквизита 	= "ТабЧасть";
		НоваяЗапись.ХранилищеТЧ 		= Новый ХранилищеЗначения(ТекущаяТЗ);
	КонецЦикла;	
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры	

Процедура ВосстановитьВерсию(НомерВерсии, ДокументИсточник, ДокументПриемникОбъект) Экспорт
	
	Если НомерВерсии = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументИсточникОбъект = ДокументИсточник.Получитьобъект();
	Если ТипЗнч(ДокументПриемникОбъект) <> ТипЗнч(ДокументИсточникОбъект) Тогда 
		#Если Клиент Тогда
		Вопрос("Тип документа для восстановления не совпадает с типом документа.", РежимДиалогаВопрос.ОК);
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Документ,
		|	ВерсииОбъектов.НомерВерсии,
		|	ВерсииОбъектов.ПериодВерсии,
		|	ВерсииОбъектов.ИмяРеквизита,
		|	ВерсииОбъектов.ЗначениеРеквизита,
		|	ВерсииОбъектов.ХранилищеТЧ
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Документ = &Документ
		|	И ВерсииОбъектов.НомерВерсии = &НомерВерсии";
	ЗапросДанных.УстановитьПараметр("Документ", ДокументИсточник);
	ЗапросДанных.УстановитьПараметр("НомерВерсии", НомерВерсии);
	РезультатЗапроса = ЗапросДанных.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		#Если Клиент Тогда
		Вопрос("По данному документу нет сохраненных версий.", РежимДиалогаВопрос.ОК);
		#КонецЕсли
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.ЗначениеРеквизита = "ТабЧасть" Тогда 
				ТаблицаДанныхТЧ = Выборка.ХранилищеТЧ.Получить();
				ДокументПриемникОбъект[Выборка.ИмяРеквизита].Загрузить(ТаблицаДанныхТЧ);
			Иначе
				ДокументПриемникОбъект[Выборка.ИмяРеквизита] = Выборка.ЗначениеРеквизита;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура УдалениеВерсий() Экспорт 
	
	ГраницаВерсий = 14; // дней хранятся версии в системе
	СекундВСутках = 60*60*24; 
	
	ЗапросВерсий = Новый Запрос;
	ЗапросВерсий.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Документ,
		|	ВерсииОбъектов.НомерВерсии,
		|	ВерсииОбъектов.ПериодВерсии,
		|	ВерсииОбъектов.ИмяРеквизита,
		|	ВерсииОбъектов.ЗначениеРеквизита,
		|	ВерсииОбъектов.ХранилищеТЧ
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.ПериодВерсии <= &ПериодВерсии";
	ЗапросВерсий.УстановитьПараметр("ПериодВерсии", ТекущаяДата() - (ГраницаВерсий * СекундВСутках));
	РезультатЗапроса = ЗапросВерсий.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ЗаписьРегистра 						= РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.Документ 			= Выборка.Документ;
			ЗаписьРегистра.НомерВерсии 			= Выборка.НомерВерсии;
			ЗаписьРегистра.ПериодВерсии 		= Выборка.ПериодВерсии;
			ЗаписьРегистра.ИмяРеквизита 		= Выборка.ИмяРеквизита;
			ЗаписьРегистра.ЗначениеРеквизита 	= Выборка.ЗначениеРеквизита;
			ЗаписьРегистра.Прочитать();
			ЗаписьРегистра.Удалить();
		КонецЦикла;	
	КонецЕсли;		
	
КонецПроцедуры	

Функция ПолучитьШтрихкод(Номенклатура, Характеристика) Экспорт
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Штрихкоды.Штрихкод
	          |ИЗ
	          |	РегистрСведений.Штрихкоды КАК Штрихкоды
	          |ГДЕ
	          |	Штрихкоды.Владелец = &Владелец
	          |	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	з.УстановитьПараметр("Владелец", Номенклатура);
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", Характеристика);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат	Выборка.Штрихкод;
	КонецЕсли;
	
	Возврат "";	
КонецФункции

Функция ПолучитьКурсОплаты(ДокументОплаты, Валюта) Экспорт
Попытка	
	Если Валюта.Код = "978" Тогда 
		Возврат ДокументОплаты.КурсEUR;
	ИначеЕсли Валюта.Код = "840" Тогда
		Возврат ДокументОплаты.КурсUSD;
	Иначе 
		Возврат 1;
	КонецЕсли;
Исключение
	Возврат 1;
	КонецПопытки;
		
КонецФункции

Процедура ЗаполнитьКурсПоМаршрутному(ТаблицаПлатежейУпр, ЭтотОбъект, ВалютаДокумента, МаршрутныйЛист, Контрагент, КурсДокумента) Экспорт
	Для Каждого СтрПлатежейУпр Из ТаблицаПлатежейУпр Цикл 
		
		КурсУпрУчетаОбм = ПолучитьКурсОплаты(ЭтотОбъект, СтрПлатежейУпр.ВалютаВзаиморасчетов);
		Если КурсУпрУчетаОбм > 0 Тогда
			СтрПлатежейУпр.КурсУпрУчета = КурсУпрУчетаОбм;
		КонецЕсли;
		КурсДокументаОбм = ПолучитьКурсОплаты(ЭтотОбъект, ВалютаДокумента);
		Если КурсДокументаОбм > 0 Тогда 
			СтрПлатежейУпр.КурсДокумента = КурсДокументаОбм;
		КонецЕсли;
		Если СтрПлатежейУпр.КурсУпрУчета = 0 Тогда 
			Если ЗначениеЗаполнено(МаршрутныйЛист) И Найти(СокрЛП(МаршрутныйЛист.Ссылка), "<") = Неопределено Тогда     //ЗаписьЖурналаРегистрации("ПКО_Обмен", УровеньЖурналаРегистрации.Информация, ,,СокрЛП(МаршрутныйЛист.Ссылка));
				МаршрутныйЛистОбъект = МаршрутныйЛист.ПолучитьОбъект();
				
				КурсРасчета 				= МаршрутныйЛистОбъект.ПолучитьКурсВалютыРасчета(Контрагент, СтрПлатежейУпр.ВалютаВзаиморасчетов);
				СтрПлатежейУпр.КурсУпрУчета = КурсРасчета.КурсУпр;
			КонецЕсли;
		КонецЕсли;
		СтрПлатежейУпр.СуммаУпр 	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрПлатежейУпр.СуммаПлатежа, ВалютаДокумента, СтрПлатежейУпр.ВалютаВзаиморасчетов, КурсДокумента, СтрПлатежейУпр.КурсУпрУчета, 1, 1);
	КонецЦикла;	

КонецПроцедуры

Процедура ОтправитьИнформациюВЧат(Текст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыЧатаУчасники.Ссылка КАК Ссылка,
	|	ГруппыЧатаУчасники.Пользователь
	|ИЗ
	|	Справочник.ГруппыЧата.Учасники КАК ГруппыЧатаУчасники
	|ГДЕ
	|	ГруппыЧатаУчасники.Ссылка.ПрисылатьИзменения
	|ИТОГИ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Организация = Справочники.Организации.НайтиПоКоду("000000001");
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		МенеджерЗаписи 					= РегистрыСведений.Чат1С.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Уид_Сообщения 	= Новый УникальныйИдентификатор;
		МенеджерЗаписи.Організація 		= Организация;
		МенеджерЗаписи.Відправник  		= Справочники.Пользователи.ПустаяСсылка();
		
		МенеджерЗаписи.Одержувач  = ВыборкаСсылка.Ссылка;
		
		МенеджерЗаписи.Повідомлення 	= Текст;
		МенеджерЗаписи.Период       	= ТекущаяДата();
		МенеджерЗаписи.ДатаНаСервере 	= ТекущаяДата();
		МенеджерЗаписи.Записать();
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РегНепрочитані = РегистрыСведений.НепрочитаніПовідомлення.СоздатьМенеджерЗаписи();			
			РегНепрочитані.Одержувач = ВыборкаДетальныеЗаписи.Пользователь;
			РегНепрочитані.Відправник = ВыборкаСсылка.Ссылка;
			РегНепрочитані.ГруппаЧата = ВыборкаСсылка.Ссылка;
			РегНепрочитані.Кол = 1;
			РегНепрочитані.Период = ТекущаяДата();
			РегНепрочитані.Записать(); 		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьАктуальностьСЗаказаСоСтатусомДоставкиПочтаСамовывоз(Реализация) Экспорт 
	
	Если (Реализация.Доставка = Перечисления.НаявністьДоставки.Почта 
		Или Реализация.Доставка = Перечисления.НаявністьДоставки.Самовывоз)
		И Не ЗначениеЗаполнено(Реализация.Сделка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Дата <= &Дата
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЗаказПокупателя.Доставка = ЗаказПокупателя.Доставка
		|	И ЗаказПокупателя.СтатусЗамовлення = &СтатусЗамовлення
		|	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Дата", Реализация.Дата);
		Запрос.УстановитьПараметр("Доставка", Реализация.Доставка);
		Запрос.УстановитьПараметр("Контрагент", Реализация.Контрагент);
		Запрос.УстановитьПараметр("СтатусЗамовлення", Справочники.СтатусиЗамовлень.Новий);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаказДляОбработки = ВыборкаДетальныеЗаписи.Ссылка;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МаршрутныйЛистЗаказы.Ссылка
			|ИЗ
			|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
			|ГДЕ
			|	МаршрутныйЛистЗаказы.ЗаказПокупателя = &ЗаказПокупателя
			|	И МаршрутныйЛистЗаказы.Ссылка.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказДляОбработки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Сделка = &ЗаказПокупателя
			|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказДляОбработки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Продолжить;
			КонецЕсли;			
			
			ЗаказДляОбработкиОбъект = ЗаказДляОбработки.ПолучитьОбъект();
			ЗаказДляОбработкиОбъект.СтатусЗамовлення = Справочники.СтатусиЗамовлень.Неактуальний;
			ЗаказДляОбработкиОбъект.Записать();
			
			РеализацияОб = Реализация.ПолучитьОбъект();
			РеализацияОб.Сделка = ЗаказДляОбработки;
			РеализацияОб.Комментарий = РеализацияОб.Комментарий + " Привязали замовлення по способу доставки Пошта або Самовивіз " + Строка(ТекущаяДата());
			РеализацияОб.Записать();
			
			ЗаписьОчереди = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
			ЗаписьОчереди.ТорговыйАгент = РеализацияОб.Контрагент.ТорговыйАгент;
			ЗаписьОчереди.КонтрагентДляДействий	= РеализацияОб.Контрагент;
			ЗаписьОчереди.ХарактеристикаДляДействий = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			ЗаписьОчереди.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов;
			ЗаписьОчереди.ПериодДобавления = ТекущаяДата();
			ЗаписьОчереди.Записать(); 						
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПеревіритиПарольЗвіту(НазваЗвіту, Отказ) Экспорт
	
	//Если РольДоступна("") Тогда
	//	Возврат;
	//КонецЕсли;
	  #Если Клиент Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПароліНаЗвіти.Пароль
	|ИЗ
	|	РегистрСведений.ПароліНаЗвіти КАК ПароліНаЗвіти
	|ГДЕ
	|	ПароліНаЗвіти.НазваЗвіту = &НазваЗвіту";
	Запрос.УстановитьПараметр("НазваЗвіту", НазваЗвіту);
	
	Вибірка = Запрос.Выполнить().Выбрать();
	Если Вибірка.Следующий() Тогда
		
		ВведенийПароль = "";
		ВвестиЗначение(ВведенийПароль, "Введіть пароль");
		
		Если ВведенийПароль = "" Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не Вибірка.Пароль = ВведенийПароль Тогда
			Отказ = Истина;
			Сообщить("Введено неправильний пароль!");
		КонецЕсли;
		
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ЗаписІсторіїЗміниХарактеристики(Характеристика, ПоточнийКористувач) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Владелец = &Владелец
	|	И Штрихкоды.ХарактеристикаНоменклатуры = &Характеристика";
	Запрос.УстановитьПараметр("Владелец", Характеристика.Владелец);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	ШК = "";
	Если Выборка.Следующий() Тогда
		ШК = Выборка.Штрихкод;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Открыт,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.ЕстьВидео,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Целевой,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.СсылкаНаYouTube,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Описание,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Бронь,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.ПериодБрони,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Контрагент,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Ефір,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.ЕфірНаДоставку,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Коментар,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.СекторНаСкладі,
	|	ІсторіяЗміниХарактеристикиСрезПоследних.Відповідальний
	|ИЗ
	|	РегистрСведений.ІсторіяЗміниХарактеристики.СрезПоследних КАК ІсторіяЗміниХарактеристикиСрезПоследних
	|ГДЕ
	|	ІсторіяЗміниХарактеристикиСрезПоследних.ХарактеристикаНоменклатури = &Характеристика";
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Вибірка = Запрос.Выполнить().Выбрать();
	Записувати = Ложь;
	Если Вибірка.Следующий() Тогда
		Если Вибірка.Бронь <> Характеристика.Бронь ИЛИ Вибірка.ЕстьВидео <> Характеристика.ЕстьВидео
			ИЛИ Вибірка.Ефір <> Характеристика.Ефір ИЛИ Вибірка.ЕфірНаДоставку <> Характеристика.ЕфірНаДоставку ИЛИ Вибірка.Коментар <> Характеристика.Коментар
			ИЛИ Вибірка.Контрагент <> Характеристика.Контрагент ИЛИ Вибірка.Описание <> Характеристика.Описание ИЛИ Вибірка.Открыт <> Характеристика.Открыт
			ИЛИ Вибірка.ПериодБрони <> Характеристика.ПериодБрони ИЛИ Вибірка.СекторНаСкладі <> Характеристика.СекторНаСкладі 
			ИЛИ Вибірка.СсылкаНаYouTube <> Характеристика.СсылкаНаYouTube ИЛИ Вибірка.Целевой <> Характеристика.Целевой Тогда
			Записувати = Истина;
		КонецЕсли;
	Иначе
		Записувати = Истина;
	КонецЕсли;	
	
	Если Записувати Тогда
		МенеджерЗапису = РегистрыСведений.ІсторіяЗміниХарактеристики.СоздатьМенеджерЗаписи();
		МенеджерЗапису.Бронь = Характеристика.Бронь;
		МенеджерЗапису.Відповідальний = ПоточнийКористувач;
		МенеджерЗапису.ЕстьВидео = Характеристика.ЕстьВидео;
		МенеджерЗапису.Ефір = Характеристика.Ефір;
		МенеджерЗапису.ЕфірНаДоставку = Характеристика.ЕфірНаДоставку;
		МенеджерЗапису.Коментар = Характеристика.Коментар;
		МенеджерЗапису.Контрагент = Характеристика.Контрагент;
		МенеджерЗапису.Описание = Характеристика.Описание;
		МенеджерЗапису.Открыт = Характеристика.Открыт;
		МенеджерЗапису.ПериодБрони = Характеристика.ПериодБрони;
		МенеджерЗапису.СекторНаСкладі = Характеристика.СекторНаСкладі;
		МенеджерЗапису.СсылкаНаYouTube = Характеристика.СсылкаНаYouTube;
		МенеджерЗапису.ХарактеристикаНоменклатури = Характеристика;
		МенеджерЗапису.Целевой = Характеристика.Целевой;
		МенеджерЗапису.Штрихкод = ШК;
		МенеджерЗапису.Период = ТекущаяДата();
		МенеджерЗапису.Активность = Истина;
		МенеджерЗапису.Користувач = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗапису.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаписЖурналРеєстраціїЗіСтекомВикликів(НазваПодії, Текст) Экспорт

	
	ПоследнееМестоВызова = "";
	Попытка
		Ошибка = 1 / 0;
	Исключение
		ПоследнееМестоВызова	= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//Отсекаем лишний текст
		
		Опис = ОписаниеОшибки();
		Инфо = ИнформацияОбОшибке();
		
		
		ПоследнееМестоВызова	= СтрЗаменить(ПоследнееМестоВызова, "Деление на 0", "");
		ПоследнееМестоВызова	= СтрЗаменить(ПоследнееМестоВызова, "Ділення на 0", "");
		ПоследнееМестоВызова	= Сред(ПоследнееМестоВызова, Найти(ПоследнееМестоВызова, ")}:ДобавитьИнформациюСозданияЭлемента(Источник);"), СтрДлина(ПоследнееМестоВызова));		
		ПоследнееМестоВызова	= СокрЛП(СтрЗаменить(ПоследнееМестоВызова, ")}:ДобавитьИнформациюСозданияЭлемента(Источник);", ""));		
	КонецПопытки;	
	
	ЗаписьЖурналаРегистрации(НазваПодії, УровеньЖурналаРегистрации.Информация,, Текст, ПоследнееМестоВызова);
КонецПроцедуры

Функция ОкруглитьСуммуДоГривни(ТЧТовары) Экспорт
	  
    Если ТЧТовары.Количество() = 0 Тогда
        Возврат Истина;
    КонецЕсли;

    Итог = 0;
    Для каждого Стр Из ТЧТовары Цикл
        Стр.Сумма = Окр(Стр.Цена * Стр.Количество, 2);
        Итог = Итог + Стр.Сумма;
    КонецЦикла;

    ЦелеваяСумма = Окр(Итог, 0);
    ОсталосьКоп = ВКопейках(ЦелеваяСумма - Итог);
    Если ОсталосьКоп = 0 Тогда
        Возврат Истина;
    КонецЕсли;

    МассивСтрок = Новый Массив;
    Для каждого Стр Из ТЧТовары Цикл
        Если Стр.Количество = 0 Тогда
            Продолжить;
        КонецЕсли;
        Данные = Новый Структура("Строка,ДельтаЦенаКоп", Стр, 0);
        МассивСтрок.Добавить(Данные);
    КонецЦикла;

    // 1) Ряды з Количество = 1 (кожен крок 0.01 дає рівно 1 коп.)
    Направление = ЗнакЧисла(ОсталосьКоп);
    Для каждого Данные Из МассивСтрок Цикл
        Стр = Данные.Строка;
        Если Стр.Количество <> 1 Тогда
            Продолжить;
        КонецЕсли;

        Пока ОсталосьКоп <> 0 И АбсЧисло(Данные.ДельтаЦенаКоп) < 100 Цикл
            Стр.Цена = Окр(Стр.Цена + Направление / 100, 2);
            Данные.ДельтаЦенаКоп = Данные.ДельтаЦенаКоп + Направление;
            Стр.Сумма = Окр(Стр.Цена * Стр.Количество, 2);
            ОсталосьКоп = ОсталосьКоп - Направление;

            Если ОсталосьКоп = 0 Тогда
                Возврат Истина;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

    // 2) Інші кількості: крок 0.01 і перевірка фактичної дельти
    Прогресс = Истина;
    Пока ОсталосьКоп <> 0 И Прогресс Цикл
        Прогресс = Ложь;
        Направление = ЗнакЧисла(ОсталосьКоп);

        Для каждого Данные Из МассивСтрок Цикл
            Стр = Данные.Строка;
            Если Стр.Количество = 1 Тогда
                Продолжить;
            КонецЕсли;

            Если АбсЧисло(Данные.ДельтаЦенаКоп) >= 100 Тогда
                Продолжить;
            КонецЕсли;

            Цена0 = Стр.Цена;
            Сумма0 = Окр(Цена0 * Стр.Количество, 2);
            Цена1 = Окр(Цена0 + Направление / 100, 2);
            Сумма1 = Окр(Цена1 * Стр.Количество, 2);
            ДельтаКоп = ВКопейках(Сумма1 - Сумма0);

            Если ДельтаКоп = 0 Тогда
                Продолжить;
            КонецЕсли;

            Если (ОсталосьКоп > 0 И ДельтаКоп > 0) Или (ОсталосьКоп < 0 И ДельтаКоп < 0) Тогда
                Если АбсЧисло(ДельтаКоп) <= АбсЧисло(ОсталосьКоп) Тогда
                    Стр.Цена = Цена1;
                    Стр.Сумма = Сумма1;
                    Данные.ДельтаЦенаКоп = Данные.ДельтаЦенаКоп + Направление;
                    ОсталосьКоп = ОсталосьКоп - ДельтаКоп;
                    Прогресс = Истина;

                    Если ОсталосьКоп = 0 Тогда
                        Возврат Истина;
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

    Возврат (ОсталосьКоп = 0);
КонецФункции

Функция ВКопейках(Сумма) Экспорт
    Возврат Цел(Окр(Сумма * 100, 0));
КонецФункции

Функция АбсЧисло(Значение) Экспорт
    Если Значение < 0 Тогда
        Возврат -Значение;
    Иначе
        Возврат Значение;
    КонецЕсли;
КонецФункции

Функция ЗнакЧисла(Значение) Экспорт
    Если Значение > 0 Тогда
        Возврат 1;
    ИначеЕсли Значение < 0 Тогда
        Возврат -1;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

Процедура ОчисткаПростроченоіБроні() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.Бронь <> ЗНАЧЕНИЕ(Справочник.ТорговыеАгенты.ПустаяСсылка)
	               |	И ХарактеристикиНоменклатуры.ПериодБрони < &ТекущаяДата";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата() - 86420);
	Виборка = Запрос.Выполнить().Выбрать();
	Пока Виборка.Следующий() Цикл
		ХарОб = Виборка.Ссылка.ПолучитьОбъект();
		ХарОб.Бронь = Справочники.ТорговыеАгенты.ПустаяСсылка();
		ХарОб.ПериодБрони = '00010101';
		ХарОб.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		ХарОб.Записать();
	КонецЦикла;
	
КонецПроцедуры
